Repository: leonidstrelok/TTHandiCrafts
Catalog: TTHandiCrafts.Infrastructure/Localizations/Resources/Messages.*.resx
Languages: tk

# SK_CascadeDependencyError
source: Ошибка обработки зависимых данных. Проверьте правильность заполнения
tk: Garaşly maglumatlary işlemekde ýalňyşlyk. Dogry doldurylandygyny barlaň

# SK_CircularNesting
source: Обнаружена циркулярная вложенность. Проверьте правильность заполнения данных.
tk: Sirkulýar mazmun anyklandy. Dogry doldurylandygyny barlaň.

# SK_EntityWithKeyDoesNotExists
source: Проверьте правильность данных.
tk: Maglumatlaryň dogrulygyny balaň.

# SK_HasOneOreMoreDependencies
source: Нельзя удалять запись, так как она уже используется.
tk: Ýazgy eýýäm ulanýandygy sebäpli pozmak mümkin dal.

# SK_ValueAlreadyExists
source: Значение уже существует
tk: Baha öňden bar

# AK_CountryCannotBeEmpty
source: Страна не может быть пустой
tk: Ýurt boş bolup bilmez

# AK_CompanyCannotBeEmpty
source: Компания не может быть пустой
tk: Kompaniýa boş bolup bilmez

# AK_CodyCannotBeEmpty
source: Код не может быть пустым
tk: Kod boş bolup bilmez

# AK_NameOfCertificationOrganizationCannotBeEmpty
source: Наименование отдела сертификации не может быть пустым
tk: Sertifisirleme bölümiň ady boş bolup bilmez

# AK_NumberCannotBeEmtpy
source: Номер не может быть пустым
tk: Belgi boş bolup bilmez

# AK_ProductCannotBeEmpty
source: Продукт не может быть пустым
tk: Önüm boş bolup bilmez

# AK_RegulationCannotBeEmpty
source: Нормативный акт не может быть пустым
tk: Delilnama boş bolup bilmez

# SSDK_ApplicationIdCannotBeEmpty
source: Идентификатор заявления не может быть пустым
tk: Arzanyň belgisi boş bolup bilmez

# SSDK_SamplesCannotBeEmpty
source: Образцы не могут быть пустыми
tk: Nusgalar boş bolup bilmez

# SSDK_SampleSelectionLocationCannotBeEmpty
source: Место выборки образцов не может быть пустым
tk: Nusgalaryň saýlanan ýeri boş bolup bilmez

# AK_EmployeesNotFromSameRegion
source: Сотрудники не из одного региона
tk: Bir sebitden däl işgärler
