Repository: leonidstrelok/TTHandiCrafts
Catalog: TTHandiCrafts/Resources/IdentityResources.*.resx
Languages: tk

# AsitsNotCurrentlyEnabled
source: поскольку в настоящее время он не включен.
tk: ýagny ol şu wagt işe girizilmändir.

# AsTheyDoNotHave2FAEnabled
source: так как они не имеют 2FA включен
tk: çünki olarda 2FA işe girizmek funksiýasy ýok

# CannotDisable2FA
source: Невозможно отключить 2FA для пользователя с идентификатором
tk: ID ulanyjysy üçin 2FA öçürmek mümkin däl

# CannotGenerateRecoveryCodesForUserWithID
source: Не удается создать коды восстановления для пользователя с идентификатором
tk: ID ulanyjysy üçin dikeldiş kodlaryny döretmek mümkin däl

# ClickingHere
source: Нажмите здесь
tk: Şu ýere tykgyldat

# CodeIsNotShouldBeEmpty
source: Код не может быть пустым
tk: Dikeldiş kody boş bolup bilmeýär

# CurrentPassword
source: Текущий Пароль
tk: Häzirki açarsözi

# DisabledSucessfull
source: 2- факторную авторизацию был отключен. Вы можете включить2- факторную авторизацию при установке приложение для проверки подлинности
tk: 2 faktorly hasaba alyş öçürlen. Siz hakylygyň barlagy üçin goşundy gurnalanda 2 faktorly hasaba alyşy işe girizip bilersiňiz

# EmailIsNotShouldBeEmpty
source: Почта не должна быть пустой
tk: Email boş bolmaly däl

# InvalidAuthenticatorCodeEnteredForUserWithID
source: Неверный код аутентификатора, введенный для пользователя с идентификатором '{UserId}'
tk: Identifikatorly ulanyjy '{UserID}' üçin girizilen hasaba alyş kodunda ýalňyşlyk

# InvalidEmailAddress
source: Пожалуйста введите валидную почту
tk: Email salgysy nädogry

# InvalidRecoveryCodeEntered
source: Неверный введенный код восстановления
tk: Girizilen dikeldiş kody nädogry

# NewPassword
source: Новый пароль
tk: Täze açarsöz

# OldPassword
source: Старый пароль
tk: Köne açarsöz

# PasswordDoNotMatch
source: Новый пароль и пароль подтверждения не совпадают.
tk: Täze açarsöz we tassyklaýyş açarsözi gabat gelmeýärler.

# PasswordIsNotShouldBeEmpty
source: Пароль не должен быть пуст
tk: Açarsöz ýeri boş bolmaly däl

# ResetPassword
source: Сброс пароля
tk: Açarsözi pozmak

# TheCurrentBrowserHasBeenForgotten
source: Текущий браузер был забыт. Когда вы снова войдете в систему из этого браузера вам будет предложено ввести свой код 2fa
tk: Häzirki brauzer unudyldy. Siz şu brauzerden ulgama gaýtadan gireniňizde öz 2fa koduňyzy girizmek teklip ediler

# UnableToLoadTwoFactorAuthenticationUser
source: Не удается загрузить пользователя с двухфакторной аутентификацией
tk: Iki faktorlyy hasaba alyşly ulanyjyny ýüklemek mümkin däl

# UnableToLoadUserWithID
source: Не удается загрузить пользователя с идентификатором
tk: ID ulanyjysyny ýüklemek mümkin däl

# UnexpectedErrorOccurredDisabling2FAForUserWithID
source: Произошла непредвиденная ошибка отключение 2FA для пользователя с идентификатором
tk: ID ulanyjysy üçin 2FA öçürmekde garaşylmadyk ýalňyşlyk ýüze çykdy

# UserNameIsNotShouldBeEmpty
source: Логин не должен быть пустым
tk: Ulanyjynyň ady boş bolmaly däl

# VerificationCodeIsInvalid
source: Неверный код подтверждения
tk: Tassyklaýyş kody nädogry

# YouHaveGeneratedNewRecoveryCodes
source: Вы создали новые коды восстановления
tk: Siz täze dikeldiş kodlaryny döretdiňiz

# YourAuthenticatorAppHasBeenVerified
source: Ваше приложение Аутентификатор было проверено
tk: Siziň Authenticator goşundyňyz barlandy

# YourAuthenticatorAppKeyHasBeenReset
source: Ваш ключ приложения authenticator был сброшен, вам нужно будет настроить свое приложение authenticator с помощью нового ключа
tk: Siziň authenticator goşundyňyz açary pozuldy

# YourPasswordHasBeenChanged
source: Ваш пароль был изменен
tk: Açarsözüňiz üýtgedildi

# ACodeMustBeSuppliedForPasswordReset
source: Для сброса пароля необходимо ввести код
tk: Açarsözi pozmak üçin kody girizmeli

# InvalidLoginAttempt
source: Неверный логин
tk: Nädogry login

# UnexpectedErrorOccurred
source: Произошла непредвиденная ошибка при загрузке внешней регистрационной информации для пользователя с идентификатором
tk: Identifikatorly ulanyjy üçin daşky hasaba alyş maglumatlary ýüklenende öňünden görülmeýän ýalňyşlyk ýüze çykdy

# PleaseResetYourPasswordBy
source: Пожалуйста, сбросьте свой пароль с помощью
tk: Kömegi bilen açarsözüňiz üçin sazlamalary pozmagyňyzy soraýarys

# YourPasswordHasBeenSet
source: Ваш пароль уже установлен
tk: Siziň açarsözüňiz eýýäm bellendi

# YourProfileHasBeenUpdated
source: Ваш профиль обновлен
tk: Siziň profiliňiz täzelendi
